Repository: Group-3-KTC/job-huntly-user-app
Catalog: src/i18n/locales/*.po
Languages: vi

source: Home
vi: Trang chủ

source: About
vi: Giới thiệu

source: Jobs
vi: Việc làm

source: Companies
vi: Công ty

source: Categories
vi: Danh mục

source: Dashboard
vi: Trang tổng quan

source: Find Jobs
vi: Tìm việc làm

source: Favorite Jobs
vi: Việc làm yêu thích

source: Find Companies
vi: Tìm công ty

source: Your First Step to a Big Future: Find a Job That Matches Your Passion & Skills.
vi: Bước đầu tiên cho tương lai lớn: Tìm công việc phù hợp với đam mê & kỹ năng của bạn.

source: Discover opportunities that fit you perfectly—from your first job to a successful career ahead.
vi: Khám phá những cơ hội phù hợp hoàn hảo với bạn — từ công việc đầu tiên đến một sự nghiệp thành công phía trước.

source: Featured job
vi: Việc làm nổi bật

source: View All
vi: Xem tất cả

source: Top companies
vi: Công ty hàng đầu

source: How JobHuntly work
vi: JobHuntly hoạt động như thế nào

source: Create account
vi: Tạo tài khoản

source: Sign up in just a few steps and start your journey toward a brighter career.
vi: Đăng ký chỉ với vài bước và bắt đầu hành trình hướng tới sự nghiệp tươi sáng.

source: Upload CV/Resume
vi: Tải CV/Sơ yếu lý lịch

source: Add your resume to help employers understand your skills and experience.
vi: Thêm hồ sơ để nhà tuyển dụng hiểu rõ kỹ năng và kinh nghiệm của bạn.

source: Find suitable job
vi: Tìm công việc phù hợp

source: Browse through thousands of job listings tailored to your profile and interests.
vi: Duyệt qua hàng nghìn tin tuyển dụng được cá nhân hóa theo hồ sơ và sở thích của bạn.

source: Apply job
vi: Ứng tuyển công việc

source: Submit your application with one click and get ready for new opportunities.
vi: Nộp hồ sơ chỉ với một lần nhấp và sẵn sàng cho cơ hội mới.

source: Register Now
vi: Đăng ký ngay

source: Become a Candidate
vi: Trở thành ứng viên

source: Become a Recruiter
vi: Trở thành nhà tuyển dụng

source: Join thousands of job seekers building their careers. Discover the right opportunities, apply with ease, and grow your future.
vi: Tham gia cùng hàng nghìn người tìm việc đang xây dựng sự nghiệp. Khám phá cơ hội phù hợp, ứng tuyển dễ dàng và phát triển tương lai của bạn.

source: Find the talent that drives your business forward. Post jobs, manage applications, and connect with the right candidates faster.
vi: Tìm kiếm nhân tài thúc đẩy doanh nghiệp tiến lên. Đăng tin tuyển dụng, quản lý hồ sơ và kết nối nhanh hơn với ứng viên phù hợp.

source: Popular category
vi: Danh mục phổ biến

source: Clients Testimonial
vi: Cảm nhận từ khách hàng

source: About JobHuntly: from First job to Big future
vi: Về JobHuntly: từ công việc đầu tiên đến tương lai lớn

source: JobHuntly was born from a simple idea: to create a job search platform that is honest, effective, and easy to use. We know that finding the right first job can feel overwhelming, so our focus is on building a clean, straightforward space where new job seekers and growing companies can connect. We're on a mission to help you find more than just a job—we're here to help you build a career.
vi: JobHuntly ra đời từ một ý tưởng đơn giản: tạo ra nền tảng tìm việc làm trung thực, hiệu quả và dễ sử dụng. Chúng tôi hiểu rằng việc tìm được công việc đầu tiên phù hợp có thể khiến bạn bối rối, vì vậy chúng tôi tập trung xây dựng một không gian sạch, rõ ràng để người tìm việc mới và các công ty đang phát triển có thể kết nối. Sứ mệnh của chúng tôi là giúp bạn tìm hơn cả một công việc — chúng tôi ở đây để giúp bạn xây dựng sự nghiệp.

source: As a new platform, we're building this community one connection at a time. Our mission is to foster a space where meaningful careers can begin. Your feedback and participation are the most important part of our growth. We are here to evolve with you and for you, helping turn your first step into a great future.
vi: Là một nền tảng mới, chúng tôi xây dựng cộng đồng này từ từng kết nối một. Sứ mệnh của chúng tôi là nuôi dưỡng một không gian nơi những sự nghiệp ý nghĩa có thể bắt đầu. Phản hồi và sự đồng hành của bạn là phần quan trọng nhất trong sự phát triển của chúng tôi. Chúng tôi ở đây để cùng bạn tiến bộ, biến bước đi đầu tiên thành một tương lai rực rỡ.

source: Honesty & Quality
vi: Trung thực & Chất lượng

source: We focus on a curated selection of verified and high-quality job listings.
vi: Chúng tôi tập trung vào danh sách việc làm đã xác minh và chọn lọc chất lượng cao.

source: Simplicity
vi: Đơn giản

source: A streamlined, minimalist interface to make your search fast and stress-free.
vi: Giao diện tinh gọn, tối giản giúp việc tìm kiếm nhanh và không căng thẳng.

source: Community-Driven
vi: Lấy cộng đồng làm trung tâm

source: We're building a valuable recruitment community with you.
vi: Chúng tôi cùng bạn xây dựng một cộng đồng tuyển dụng giá trị.

source: Feedback Matters
vi: Phản hồi là quan trọng

source: Our platform evolves based on the insights you share.
vi: Nền tảng phát triển dựa trên những góp ý bạn chia sẻ.

source: Call now
vi: Gọi ngay

source: Quick Link
vi: Liên kết nhanh

source: About Us
vi: Giới thiệu

source: Statistics
vi: Thống kê

source: Candidate
vi: Ứng viên

source: Browse Companies
vi: Duyệt công ty

source: Browse Jobs
vi: Duyệt việc làm

source: Candidate Dashboard
vi: Trang tổng quan ứng viên

source: Saved Jobs
vi: Việc làm đã lưu

source: Recruiter
vi: Nhà tuyển dụng

source: Post a Job
vi: Đăng tin tuyển dụng

source: Recruiter Dashboard
vi: Trang tổng quan nhà tuyển dụng

source: Applications
vi: Đơn ứng tuyển

source: Company Profile
vi: Hồ sơ công ty

source: 2025 JobHuntly. All rights Reserved
vi: 2025 JobHuntly. Bảo lưu mọi quyền

source: Register
vi: Đăng ký

source: Login
vi: Đăng nhập

source: Work Type
vi: Hình thức làm việc

source: Levels
vi: Cấp bậc

source: Skills
vi: Kỹ năng

source: Job Description
vi: Mô tả công việc

source: Requirements
vi: Yêu cầu

source: Benefits
vi: Phúc lợi

source: Work Location
vi: Địa điểm làm việc

source: Similar Jobs
vi: Việc làm tương tự

source: See More
vi: Xem thêm

source: Show less
vi: Thu gọn

source: Search for a company
vi: Tìm kiếm công ty

source: Discover companies that match your interests and skills. Search by name, location, industry, or size.
vi: Khám phá các công ty phù hợp với sở thích và kỹ năng của bạn. Tìm theo tên, địa điểm, ngành hoặc quy mô.

source: Filter
vi: Lọc

source: Clear all
vi: Xoá tất cả

source: Industry
vi: Ngành nghề

source: Company size
vi: Quy mô công ty

source: Founded year
vi: Năm thành lập

source: Unfollow
vi: Bỏ theo dõi

source: Follow Company
vi: Theo dõi công ty

source: You need to log in
vi: Bạn cần đăng nhập

source: Please log in to continue.
vi: Vui lòng đăng nhập để tiếp tục.

source: Close
vi: Đóng

source: Logout
vi: Đăng xuất

source: Company Introduction
vi: Giới thiệu công ty

source: Contact Information
vi: Thông tin liên hệ

source: Job Openings
vi: Tin tuyển dụng

source: Representative brands in the same field
vi: Thương hiệu tiêu biểu trong cùng lĩnh vực

source: The brands that have established their position on the market.
vi: Những thương hiệu đã tạo dựng vị thế trên thị trường.

source: Share company with friends
vi: Chia sẻ công ty với bạn bè

source: Share on social media
vi: Chia sẻ lên mạng xã hội

source: Link your account to continue using Job Huntly's services.
vi: Liên kết tài khoản của bạn để tiếp tục sử dụng dịch vụ của Job Huntly.

source: This account uses Google Sign-In. Do you want to set a password so you can log in with email/password too?
vi: Tài khoản này đang dùng đăng nhập Google. Bạn có muốn đặt mật khẩu để cũng có thể đăng nhập bằng email/mật khẩu không?

source: We sent a set-password link to your email. Click the link to continue here.
vi: Chúng tôi đã gửi liên kết đặt mật khẩu đến email của bạn. Nhấp liên kết để tiếp tục tại đây.

source: Forgot password?
vi: Quên mật khẩu?

source: Don't have an account yet?
vi: Chưa có tài khoản?

source: Create one
vi: Tạo tài khoản

source: Create your Candidate account
vi: Tạo tài khoản Ứng viên

source: Find jobs, track applications, and connect with recruiters.
vi: Tìm việc làm, theo dõi đơn ứng tuyển và kết nối với nhà tuyển dụng.

source: Create your Recruiter account
vi: Tạo tài khoản Nhà tuyển dụng

source: Post jobs, manage applicants, and hire faster.
vi: Đăng tin tuyển dụng, quản lý ứng viên và tuyển dụng nhanh hơn.

source: Welcome to
vi: Chào mừng đến với

source: If you have trouble logging in or creating an account, please contact Job Huntly via
vi: Nếu bạn gặp khó khăn khi đăng nhập hoặc tạo tài khoản, vui lòng liên hệ Job Huntly qua

source: I have read and agree to the
vi: Tôi đã đọc và đồng ý với

source: Terms of Service
vi: Điều khoản dịch vụ

source: and
vi: và

source: Privacy Policy
vi: Chính sách quyền riêng tư

source: of JobHuntly
vi: của JobHuntly

source: Already have an account?
vi: Đã có tài khoản?

source: Login Now
vi: Đăng nhập ngay

source: Job title, Keyword...
vi: Tên công việc, Từ khóa...

source: Find Job
vi: Tìm việc

source: Company Events
vi: Sự kiện công ty

source: Experience highlights from recent events, conferences, and workshops — where we bring innovation to life and connect with community.
vi: Trải nghiệm những điểm nhấn từ các sự kiện, hội thảo và workshop gần đây — nơi chúng tôi hiện thực hóa đổi mới và kết nối cộng đồng.

source: Recap Korean Insight Trip 2025
vi: Tổng kết Korean Insight Trip 2025

source: A special journey bringing K-Tech College 2025 candidates closer to Korean enterprises and global work culture. Memorable experiences and clearer views of a global career path.
vi: Hành trình đặc biệt đưa các ứng viên K-Tech College 2025 đến gần hơn với doanh nghiệp Hàn Quốc và văn hóa làm việc toàn cầu. Trải nghiệm đáng nhớ và cái nhìn rõ ràng hơn về lộ trình sự nghiệp quốc tế.

source: August
vi: Tháng Tám

source: July
vi: Tháng Bảy

source: June
vi: Tháng Sáu

source: May
vi: Tháng Năm

source: Korea
vi: Hàn Quốc

source: Event Highlight
vi: Điểm nhấn sự kiện

source: Mentoring Day — What Korean Mentors Think
vi: Ngày Mentoring — Góc nhìn của các mentor Hàn Quốc

source: Honest sharing from mentors about working with Vietnamese candidates and what stands out in the eyes of employers. Don’t miss K-Tech Fest 2025 for more 1:1 mentor sessions!
vi: Chia sẻ thẳng thắn từ các mentor về việc làm việc với ứng viên Việt Nam và điều nổi bật trong mắt nhà tuyển dụng. Đừng bỏ lỡ K-Tech Fest 2025 để có thêm các buổi mentor 1:1!

source: Ho Chi Minh City
vi: TP. Hồ Chí Minh

source: Mentoring Day
vi: Ngày Mentoring

source: Recap Offline Interview
vi: Tổng kết buổi phỏng vấn trực tiếp

source: Korean tech companies praised the potential of Vietnamese candidates and the role of K-Tech College in global talent matching. Hear their reflections from the on-site interviews.
vi: Các công ty công nghệ Hàn Quốc đánh giá cao tiềm năng của ứng viên Việt Nam và vai trò của K-Tech College trong kết nối nhân tài toàn cầu. Cùng lắng nghe chia sẻ của họ từ các buổi phỏng vấn trực tiếp.

source: Interview Series
vi: Chuỗi phỏng vấn

source: Customer Success Stories
vi: Câu chuyện thành công của khách hàng

source: Direct stories from clients about their transformation journeys and results achieved with our programs and partners.
vi: Những câu chuyện trực tiếp từ khách hàng về hành trình chuyển đổi và kết quả đạt được cùng chương trình và đối tác của chúng tôi.

source: Virtual Event
vi: Sự kiện trực tuyến

source: Success Stories
vi: Câu chuyện thành công

source: Open Positions
vi: Vị trí đang tuyển

source: Search
vi: Tìm kiếm

source: Not found
vi: Không tìm thấy

source: Reset
vi: Đặt lại

source: See Detail
vi: Xem chi tiết

source: Please select at least 1 Category to display the list Skills.
vi: Vui lòng chọn ít nhất 1 Danh mục để hiển thị danh sách Kỹ năng.

source: City
vi: Thành phố

source: Re-applying
vi: Đang ứng tuyển lại

source: Submitting
vi: Đang ứng tuyển

source: Re-apply
vi: Ứng tuyển lại

source: Apply
vi: Ứng tuyển

source: Cancel
vi: Hủy

source: Cover Letter
vi: Thư giới thiệu

source: Phone Number
vi: Số điện thoại

source: Full Name
vi: Họ và tên

source: Selected File
vi: Chọn tệp

source: Change CV
vi: Đổi CV

source: Upload CV
vi: Tải CV

source: Upload New CV
vi: Tải CV mới

source: Keep Current CV
vi: Giữ CV hiện tại

source: Download
vi: Tải xuống

source: View
vi: Xem

source: Previously Submitted CV
vi: CV đã nộp trước đó

source: Your previous information has been filled in. You can edit if needed.
vi: Thông tin trước đó của bạn đã được điền. Bạn có thể chỉnh sửa nếu cần.

source: Loading application details
vi: Đang tải chi tiết đơn ứng tuyển

source: Re-application submitted successfully!
vi: Ứng tuyển lại thành công!

source: Application submitted successfully!
vi: Nộp đơn thành công!

source: Please upload a new CV.
vi: Vui lòng tải lên một CV mới.

source: Please upload your CV.
vi: Vui lòng tải lên CV của bạn.

source: Job saved successfully
vi: Đã lưu việc làm thành công

source: Job unsaved
vi: Đã bỏ lưu việc làm

source: You have reached the re-application limit (2 times).
vi: Bạn đã đạt giới hạn ứng tuyển lại (2 lần).

source: You re-applied 30 minutes ago. Please wait to try again.
vi: Bạn vừa ứng tuyển lại cách đây 30 phút. Vui lòng chờ để thử lại.

source: View Details
vi: Xem chi tiết

source: Loading
vi: Đang tải

source: Profile
vi: Hồ sơ

source: Manage CV
vi: Quản lý CV

source: My Interviews
vi: Phỏng vấn của tôi

source: Company Follows
vi: Công ty đang theo dõi

source: My Jobs
vi: Việc làm của tôi

source: Settings
vi: Cài đặt

source: Manage Jobs
vi: Quản lý tin tuyển dụng

source: Candidates
vi: Ứng viên

source: Payment History
vi: Lịch sử thanh toán

source: Upgrade Vip
vi: Nâng cấp VIP
